DataProcessors/Предпросмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>Предпросмотр</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеДвоичныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Comment>Хранение ссылки на объект Не позволит штатными средствами удалить объект без очистки всех прикреплений</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХраненияФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоХраненияПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеИмениФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НазначениеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НазначениеФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Предпросмотр/Forms/ФормаПредпросмотра/Ext/Form/Module.bsl
#Область СобытияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбъектСсылка 	= Параметры.ВладелецСсылка;
	НазначениеФайла = Параметры.НазначениеФайла;
	
	// заголовок
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка._Инвойс") Тогда
	
		Запись = регистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
		Запись.Инвойс = ОбъектСсылка;
		Запись.Прочитать();          
		Если Запись.Выбран() Тогда
			лСтатус = " " + Запись.Статус;
		Иначе
			лСтатус = "";	
		КонецЕсли;
		
		Представление = СтрШаблон("%1 %2 от %3 (%4%5)",
								НСтр("ru = 'Инвойс'; en = 'Invoice'"),
								ОбъектСсылка.ВКД_НомерИнвойсаПоставщика,
								Формат(ОбъектСсылка.ВКД_ДатаИнвойсаПоставщика, "ДФ=dd.MM.yy"),
								ОбъектСсылка.Валюта.Символ + Формат(ОбъектСсылка.Сумма, "ЧДЦ=2"),
								лСтатус);
								
		ОбъектСсылка = ОбъектСсылка.ДокументОснование;						
								
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ИнвойсЗакупки") Тогда

		Представление = СтрШаблон("%1 %2 от %3 (%4) %5",
								НСтр("ru = 'Инвойс'; en = 'Invoice'"),
								ОбъектСсылка.НомерИнвойсаПоставщика,
								Формат(ОбъектСсылка.ДатаИнвойсаПоставщика, "ДФ=dd.MM.yy"),
								ОбъектСсылка.Валюта.Символ + Формат(ОбъектСсылка.Сумма, "ЧДЦ=2"),
								?(НазначениеФайла=Перечисления.НазначениеФайлов.Оплата, НСтр("ru = 'оплаты'; en = 'payments'"), "")
								);
	Иначе
	
		 Представление = ОбщегоНазначения.ПредставлениеДокументаДляПечати(ОбъектСсылка);
	
	КонецЕсли;
	ЭтаФорма.Заголовок = Представление;
	
	// файлы
	СформироватьГиперссылкиФайловНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Параметры.ИмяАктивнойГиперссылки) И Элементы.Найти(Параметры.ИмяАктивнойГиперссылки) <> Неопределено Тогда      
		ТекущийЭлемент = Элементы[Параметры.ИмяАктивнойГиперссылки];
		НажатиеГиперссылкиФайла(Элементы[Параметры.ИмяАктивнойГиперссылки], Истина);
	КонецЕсли;
   	Если ЗначениеЗаполнено(Параметры.ДобавлениеФайла) И Параметры.ДобавлениеФайла Тогда
		 ДобавитьФайл(Неопределено);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СобытияЭлементовФормы 

&НаКлиенте
Процедура НажатиеГиперссылкиФайла(Элемент, СтандартнаяОбработка) 
	
	ПутьКВременномуФайлу = СоздатьВременныйФайлНаСервере(Элемент.Заголовок);  
	
	Расширение = ОбщегоНазначения.РасширениеБезТочки(ОбщегоНазначения.ПолучитьРасширение(Элемент.Заголовок));
	Если Расширение = "pdf" Тогда
		HTML = ОткрытиеPDF(ПутьКВременномуФайлу);

	ИначеЕсли Найти(".xls;.xlsx;.xlw;.xml",Расширение) <> 0 Тогда
		//ЗапуститьПриложение(ПутьКВременномуФайлу);
		//Возврат;
		Элементы.HTML.Видимость = Истина;
		Элементы.АдресКартинки.Видимость = Ложь;
		ЭтаФорма.HTML = ТекстСпинера();
		Excel = Новый COMОбъект("Excel.Application");
		WorkBook = Excel.WorkBooks.Open(ПутьКВременномуФайлу); 
		ИмяВремФайла = ПолучитьИмяВременногоФайла(".html");  
		WorkBook.SaveAs(ИмяВремФайла, 44);
		Excel.Quit();
		ЭтаФорма.HTML = ИмяВремФайла;
		
	ИначеЕсли Найти(".doc;.docx",Расширение) <> 0 Тогда
		//ЗапуститьПриложение(ПутьКВременномуФайлу);
		//Возврат;
		Элементы.HTML.Видимость = Истина;
		Элементы.АдресКартинки.Видимость = Ложь; 
		ЭтаФорма.HTML = ТекстСпинера();
	    Word = Новый COMОбъект("Word.Application");
		Document = Word.Documents.Open(ПутьКВременномуФайлу); 
		ИмяВремФайла = ПолучитьИмяВременногоФайла(".html");  
		Document.SaveAs(ИмяВремФайла, 8);
		Word.Quit();
		ЭтаФорма.HTML = ИмяВремФайла;

	Иначе	
		ОткрытиеКартинки(ПутьКВременномуФайлу);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НажатиеУдалениеФайла(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Список = Новый СписокЗначений;
	Список.Добавить(0, НСтр("ru = 'Удалить файл'; en = 'Delete file'"),,БиблиотекаКартинок.Удалить);
	Список.Добавить(1, НСтр("ru = 'Открыть внешней программой'; en = 'Open with external program'"),,БиблиотекаКартинок.ОткрытьФайл);
	Список.Добавить(2, НСтр("ru = 'Сохранить файл'; en = 'Save file'"),,БиблиотекаКартинок.Записать);
	Список.Добавить(3, НСтр("ru = 'Инфо'; en = 'About file'"),,БиблиотекаКартинок.Справка);
	Выб = ВыбратьИзМеню(Список, Элемент);  
	Если Выб <> Неопределено Тогда 
		ИмяФайла = Элементы[СтрЗаменить(Элемент.Имя, "Картинка", "Файл")].Заголовок;
        ДанныеФайла = ДанныеФайла(ИмяФайла);
		Если Выб.Значение = 0 Тогда
		
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтаФорма, ДанныеФайла),
				СтрШаблон(НСтр("ru = 'Уверены, что хотите удалить файл %1%2 ?'; en = 'Are you sure you want to delete the file %1%2 ?'"), 
							ДанныеФайла.ИмяФайла, 
							ДанныеФайла.РасширениеИмениФайла),  
				РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет, НСтр("ru = 'Удаление прикрепленного файла'; en = 'Delete an attached file'"));
		
		ИначеЕсли Выб.Значение = 1 Тогда
		    ЗапуститьПриложение(ДанныеФайла.ПутьФайла + "\" + ДанныеФайла.ИмяФайла + ДанныеФайла.РасширениеИмениФайла);
		ИначеЕсли Выб.Значение = 2 Тогда
			ЗаписатьФайл(ДанныеФайла.ПутьФайла, ДанныеФайла.ИмяФайла, ДанныеФайла.РасширениеИмениФайла);
		ИначеЕсли Выб.Значение = 3 Тогда
			клПредупреждение(СтрШаблон("%1: %2
									   	|%3: %4 kByte
										|%5: %6", 
										НСтр("ru = 'Автор'; en = 'Author'"),
										ДанныеФайла.Автор,
										НСтр("ru = 'Размер файла'; en = 'File size'"),
										Формат(ДанныеФайла.РазмерФайла/1024, "ЧДЦ=2"),
										НСтр("ru = 'Записан'; en = 'Save'"),
										ДанныеФайла.Период
										), , ИмяФайла);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(ВыборПользователя, ДополнительныеПараметры) Экспорт
	
	Если ВыборПользователя = КодВозвратаДиалога.Да Тогда 
		лОтказ			= Ложь;
		лСообщение		= "";
		УдалитьФайл(ДополнительныеПараметры, лОтказ, лСообщение);
		Если лОтказ Тогда 
			клОшибка(лСообщение);
		Иначе      
			СформироватьГиперссылкиФайловНаФорме(); 
			HTML = "";
			АдресКартинки = "";
			//	ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Удаление);
			Оповестить("ОбновитьСтрокуПрикреплений",,ЭтаФорма);
			//ОповеститьОбИзменении(ЭтаФорма.Параметры.ВладелецСсылка);
			ОповеститьОбИзменении(ОбъектСсылка);
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры // ПослеОтветаНаВопрос()

#КонецОбласти


#Область ДобавлениеФайла

&НаКлиенте
Процедура ДобавитьФайл(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораФайла", ЭтаФорма, НазначениеФайла);
	//открыть диалог выбора файла. Если пользователь работает из ВебКлиента, то открывается соединение с типом "WebServerExtension"
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, ОбъектУИД); 

КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВыбораФайла(ЕстьВыборПользователя, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт 
	
	Если ЕстьВыборПользователя = Ложь Тогда
        Возврат;
    КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		клПредупреждение(НСтр("ru = 'Сначала запишите документ!'; en = 'First save the document!'"));  
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		//в параметре "ВыбранноеИмяФайла" строка имени файла без полного пути, например: name.ext
		л_ОписаниеФайла = Новый Структура();
		л_ОписаниеФайла.Вставить("Имя", 				ВыбранноеИмяФайла);
		л_ОписаниеФайла.Вставить("ИмяБезРасширения", 	ОбщегоНазначения.ПолучитьИмяБезРасширения(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("ПолноеИмя", 			"");
		л_ОписаниеФайла.Вставить("Путь", 				"");
		л_ОписаниеФайла.Вставить("Расширение", 			ОбщегоНазначения.ПолучитьРасширение(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("Размер", 				ПолучитьИзВременногоХранилища(Адрес).Размер());
		л_ОписаниеФайла.Вставить("Назначение", 			ДопПараметры);
		//л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);

		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи	= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор");
		
		//ДобавитьВложенныйФайл(Адрес, ВладелецФормы.Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Адрес, ОбъектСсылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
		Если НЕ л_Отказ Тогда 
			ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
			Оповестить("ОбновитьСтрокуПрикреплений", л_ОписаниеФайла.Имя, ЭтаФорма);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(л_Сообщение) Тогда
			клПредупреждение(л_Сообщение);
		КонецЕсли;
		
	Иначе 		
		
		л_Файл = Новый Файл(ВыбранноеИмяФайла);
		л_ОписаниеФайла = Новый Структура("Имя,ИмяБезРасширения,ПолноеИмя,Путь,Расширение");
		ЗаполнитьЗначенияСвойств(л_ОписаниеФайла, л_Файл);
		л_ОписаниеФайла.Вставить("Размер",					0);
		л_ОписаниеФайла.Вставить("Файл",					л_Файл);
		л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);
		л_ОписаниеФайла.Вставить("Назначение", 				ДопПараметры);
		
		л_Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтаФорма, л_ОписаниеФайла));
		
	КонецЕсли;
	
КонецПроцедуры // ПослеПомещенияФайлаВоВременноеХранилище()

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(ФайлСуществует, ПараметрыФайла) Экспорт 
	
	Если ФайлСуществует Тогда 
		ПараметрыФайла.Файл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеПолученияРазмераФайла", ЭтаФорма, ПараметрыФайла));
	Иначе 
		клОшибка(СтрШаблон( НСтр("ru = 'Папка %1 не существует!'; en = 'Folder %1 does not exist!'"), ПараметрыФайла.Путь)); 
	КонецЕсли;  
	
КонецПроцедуры // ПослеПроверкиСуществованияФайла()

&НаКлиенте
Процедура ПослеПолученияРазмераФайла(Результат, Параметр) Экспорт
	
	Параметр.Размер = Результат;
	
	//удалить свойство структуры "Файл" т.к. оно вызывает ошибку преобразования данных XDTO: Отсутствует отображение для типа 'Файл'
	Параметр.Удалить("Файл");
	
	л_Отказ		= Ложь;
	л_Сообщение	= "";
	л_КлючЗаписи= Новый Структура("ОбъектУИД, ОбъектСсылка, МестоХраненияФайлов, ИмяФайла, РасширениеИмениФайла, Автор, НазначениеФайла");
	
	ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, ОбъектСсылка, Параметр, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
	Если НЕ л_Отказ Тогда 
		ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление); 
		СформироватьГиперссылкиФайловНаФорме();  
		ТекущийЭлемент = Элементы.Группафайлы.ПодчиненныеЭлементы[Элементы.Группафайлы.ПодчиненныеЭлементы.Количество()-1].ПодчиненныеЭлементы[1];
		НажатиеГиперссылкиФайла(ТекущийЭлемент, Истина);
		Оповестить("ОбновитьСтрокуПрикреплений", Параметр.Имя, ЭтаФорма); 
		//ОповеститьОбИзменении(Параметры.ВладелецСсылка);
		ОповеститьОбИзменении(ОбъектСсылка);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(л_Сообщение) Тогда
		Сообщить(л_Сообщение);
	КонецЕсли;   
	
КонецПроцедуры 

#КонецОбласти


#Область УдалениеФайла

&НаСервереБезКонтекста
Процедура УдалитьФайл(Знач КлючЗаписи, Отказ, Сообщение)  
	
	НачатьТранзакцию();
	РегистрыСведений.ХранилищеФайлов.УдалитьФайлСДиска(КлючЗаписи, Отказ, Сообщение);
	Если Отказ Тогда 
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	РегистрыСведений.ХранилищеФайлов.УдалитьЗаписьИзРегистра(КлючЗаписи, Отказ, Сообщение);
	Если Отказ Тогда 
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // УдалитьВложенныйФайл()
	
#КонецОбласти


#Область ЗаписьФайла

&НаКлиенте
Процедура ЗаписатьФайл(Путь, Имя, Расширение)

    ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
    //ДиалогОткрытия.Каталог = Объект.Путь;  
    ДиалогОткрытия.Заголовок = Нстр("ru = 'Выберите каталог'; en = 'Select folder'");  
        
    Параметр = Новый Структура("Путь,Имя,Расширение",Путь, Имя, Расширение);
    Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект, Параметр);
    ДиалогОткрытия.Показать(Оповещение)
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, Параметр) Экспорт
	
	Если Результат <> Неопределено Тогда      
	 	Путь = Результат[0] + "\" + Параметр.Имя + Параметр.Расширение;  
		Попытка
		    СкопироватьФайл(Параметр.Путь + "\" + Параметр.Имя + Параметр.Расширение, Путь);
		    клНамекнуть("Записан файл", Параметр, БиблиотекаКартинок.Записать);
		Исключение
		    Сообщить(ОписаниеОшибки());
		КонецПопытки;
    КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФайл(Источник, Назначение)
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Источник));
    л_ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресХранилища);
	л_ДвоичныеДанныеФайла.Записать(Назначение); 

КонецПроцедуры

#КонецОбласти


&НаСервере
Функция ТекстСпинера()

	Возврат Обработки.Предпросмотр.ПолучитьМакет("Spiner").ПолучитьТекст();	

КонецФункции 

&НаСервере
Процедура СформироватьГиперссылкиФайловНаФорме()

	ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(ОбъектСсылка, ЭтаФорма, Элементы.ГруппаФайлы, НазначениеФайла, "НажатиеГиперссылкиФайла", "НажатиеУдалениеФайла");
	
КонецПроцедуры

&НаСервере
Функция ДанныеФайла(ИмяФайла, ТолькоСведения = Истина)

	л_НастройкаХраненияФайлов = ОбщегоНазначенияПовтИсп.НастройкаХраненияФайлов();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(СтрЗаменить(Новый УникальныйИдентификатор, "-", "") + ОбщегоНазначения.ПолучитьРасширение(ИмяФайла));
	Ключ = Новый Структура("ИмяФайла, МестоХраненияФайлов, ОбъектУИД, ОбъектСсылка, НазначениеФайла", 
						ОбщегоНазначения.ПолучитьИмяБезРасширения(ИмяФайла),
                        л_НастройкаХраненияФайлов.МестоХраненияФайлов,
                        ОбъектСсылка.УникальныйИдентификатор(),
						ОбъектСсылка,  
						НазначениеФайла
						);
	Запись = РегистрыСведений.ХранилищеФайлов.ПолучитьЗапись(Ключ);  
	Если ТолькоСведения Тогда
		СтруктураЗаписи = Новый Структура("ИмяФайла, МестоХраненияФайлов, ОбъектУИД, ОбъектСсылка, НазначениеФайла, РасширениеИмениФайла, Автор, РазмерФайла, ПутьФайла, Период");	
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		Возврат СтруктураЗаписи;	
	Иначе
		Возврат Запись;	
	КонецЕсли;

КонецФункции 

&НаСервере
Функция СоздатьВременныйФайлНаСервере(ИмяФайла)
	
	Запись = ДанныеФайла(ИмяФайла);
	
	Возврат Запись.ПутьФайла + "\" + Запись.ИмяФайла + Запись.РасширениеИмениФайла;
	
	//ДанныеФайла = Новый ДвоичныеДанные(Запись.ПутьФайла + "\" + Запись.ИмяФайла + Запись.РасширениеИмениФайла);
	//ДанныеФайла.Записать(ИмяВременногоФайла);
	//
	//Возврат ИмяВременногоФайла;
	
КонецФункции


&НаСервере
Функция ОткрытиеPDF(ПутьКВременномуФайлу)
	
	Элементы.HTML.Видимость = Истина;
	Элементы.АдресКартинки.Видимость = Ложь;

	HTML = СтрЗаменить(Обработки.Предпросмотр.ПолучитьМакет("Предпросмотр_Макет").ПолучитьТекст(), "<TextScript111>", Обработки.Предпросмотр.ПолучитьМакет("Предпросмотр_СкриптБиблиотека").ПолучитьТекст());
  
  	HTML = СтрЗаменить(HTML,"<TextScript112>", Обработки.Предпросмотр.ПолучитьМакет("Предпросмотр_СкриптWorker").ПолучитьТекст());
	  
	HTML = СтрЗаменить(HTML, "<url1S>","file:///" + СтрЗаменить(ПутьКВременномуФайлу, "\", "//"));
	
	Возврат HTML;

КонецФункции

&НаСервере
Процедура ОткрытиеКартинки(ПутьКВременномуФайлу)
	
	Элементы.HTML.Видимость = Ложь;
	Элементы.АдресКартинки.Видимость  = Истина;
	АдресДанные = Новый ДвоичныеДанные(ПутьКВременномуФайлу);
	АдресКартинки = ПоместитьВоВременноеХранилище(АдресДанные, УникальныйИдентификатор);

КонецПроцедуры
